Revit 2024 API
ParameterTypeId.DividedpathTotalPathLength Property
 "Path Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DividedpathTotalPathLength { get; }
Visual Basic
Public Shared ReadOnly Property DividedpathTotalPathLength As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DividedpathTotalPathLength {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace